{"general information":{"name":"Daniel Chen","label":"","image":"/assets/img/Affirm_logo.png","email":"danielmc4102@gmail.com","phone":"","url":"https://danielkmc.github.io/","summary":"","location":{"address":"","postalCode":"","city":"","countryCode":"","region":""}},"work":[{"name":"","position":"Software Engineer - Affirm","url":"https://affirm.com/","startDate":"2022-06","endDate":"2023-02","summary":"","highlights":["Aided in Snowflake region configuration of roles, databases, tables, and warehouses using Terraform and refactoring of existing Dbt code to include new regions.","Designed and deployed Buildkite CI tests using Python, Airflow, and K8s to identify PII usage across all Dbt models.","Developed Airflow jobs to track replicated Snowflake data freshness, providing BI teams clarity on updates and improving on-call resolution times.","Performed independent cost analysis on company’s Dbt and Snowflake scaling, which lead to multi-million dollar savings in department usage of the services.","Maintained Python CLI tooling used to deploy new Dbt ELTs, providing continuous support for all users.","Designed and supported Looker dashboards for critical reports and email alerts."]},{"name":"","position":"Data Analyst - Integra FEC","url":"https://integrafec.com/","startDate":"2022-01","endDate":"2022-04","summary":"","highlights":["Designed Python scripts to trace blockchain transactions and generate charts in Jupyter using Matplotlib and Seaborn visualization packages.","Redesigned and provided documentation for research-grade C# project used to generate mark-up and mark-down pricing data of municipal bond sales from financial institutions."]},{"name":"","position":"Data Engineer Intern - H-E-B","url":"https://heb.com/","startDate":"2021-06","endDate":"2021-08","summary":"","highlights":["Worked on React dashboard using PostgreSQL databases to display ETL job statuses, user database permissions, and service-level agreements (SLAs) using K8s, Docker, and Datadog."]}],"volunteer":[],"education":[{"institution":"","url":"https://www.utexas.edu/","area":"","studyType":"The University of Texas at Austin - B.S. Computer Science, B.S. Mathematics","startDate":"2018-08","endDate":"2022-12","score":"","courses":[{"name":"Teaching Assistant for Principles of Computer Systems","description":"Provided assistance teaching about topics for approximately 450 students over four semesters relating to the x86-64 Linux operating system as well as the C language. Covered topics over CPU scheduling, processes, synchronization, virtual memory, file systems, and networking."},{"name":"Coursework","description":"Distributed Systems, Algorithms, Principles of Computer Systems, Data Structures, Advanced Machine Learning, Discrete Math, Probability and Statistics, Decision Analytics"}]}],"certificates":[],"publications":[],"skills":[],"languages":[],"programming skills":[{"name":"Languages","highlights":["Modern C++, Python, Golang, C, Java, SQL"]},{"name":"Technologies","highlights":["Linux, Shell Scripting, Snowflake, Machine learning, Dbt, Airflow, Git, CI/CD, Docker, Looker, Terraform"]}],"interests":[],"references":[],"projects":[]}